
1. ¿Qué diferencia hay entre una Serie y un DataFrame?
- La serie es una dimensión y sólo tiene un tipo de datos mientras que el DataFrame tiene dos dimensiones y puede contener diferentes tipos de datos, aunque el mismo en una columna. El índice de  

Es el turno de los DataFrames

Crea un array de dos dimensiones con 4 filas y 3 columnas.

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

Descarga el archivo "medallas" y carga el DataFrame.

Usando el loc extrae todas las columnas de la fila de Tailandia.

Usando el loc extrae todas las columnas de China e Irán.

Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

Usando el iloc extrae la información de la India. Devolved todas las columnas.

Usando el iloc extrae todas las columnas de los países que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [3]:
import numpy as np
import pandas as pd

In [17]:
a = np.random.random_sample((4,3))
a

array([[0.28453705, 0.86565342, 0.45960549],
       [0.94342417, 0.53555489, 0.14032956],
       [0.07970603, 0.9972731 , 0.41246158],
       [0.34602441, 0.26724773, 0.65723845]])

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [19]:
df = pd.DataFrame(a, columns = ["España", "Francia", "Italia"])
df

     España   Francia    Italia
0  0.284537  0.865653  0.459605
1  0.943424  0.535555  0.140330
2  0.079706  0.997273  0.412462
3  0.346024  0.267248  0.657238

In [26]:
df_medallas = pd.read_csv("medallas.csv", index_col= 0)
dfmedallas = pd.DataFrame(df_medallas)
dfmedallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

Usando el loc extrae todas las columnas de la fila de Tailandia.

Usando el loc extrae todas las columnas de China e Irán.
Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [27]:
dfmedallas.loc[7,]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

In [28]:
dfmedallas.loc[[1,4],]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

In [31]:
dfmedallas.loc[[1,4],["Oro", "Plata" , "Bronce"]]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

Usando el iloc extrae la información de la India. Devolved todas las columnas.

Usando el iloc extrae todas las columnas de los países que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [34]:
dfmedallas.iloc[5,]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object

In [ ]:
dfmedallas.iloc[1::2] #impares por índice

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
4              Irán   179    181     197
6             India   154    202     315
8         Indonesia   112    131     240
10  Corea del Norte    91    120     235

In [ ]:
dfmedallas.iloc[1::2, 1:4] #s:s:s con ,

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235


¿Qué país consiguió más de 200 medallas de oro?

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

Crea una nueva columna que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [45]:
dfmedallas["Oro"] > 200

1      True
2      True
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10    False
Name: Oro, dtype: bool

In [50]:
dfmedallas.loc[dfmedallas["Oro"] > 200, ["País", "Oro"]]

            País   Oro
1          China  1473
2          Japón  1032
3  Corea del Sur   745

In [54]:
dfmedallas.loc[(dfmedallas["Oro"]> 200) & (dfmedallas["Plata"] > 1000), "País"]

2    Japón
Name: País, dtype: object

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

Crea una nueva columna que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [56]:
dfmedallas.loc[(dfmedallas["Oro"]> 200) | (dfmedallas["Bronce"] > 700), "País"]

1            China
2            Japón
3    Corea del Sur
Name: País, dtype: object


Momento de trabajar con Series. Contesta a las siguientes preguntas:

Crea dos listas:

Una que se llame "valores" que tenga 7 números aleatorios.

Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más información sobre este método aquí.

In [72]:
valores = np.random.randint(2,20, 7)
valores

array([ 9, 19, 11,  5, 18, 13,  6])

In [59]:
indices = ["Lunes", "Martes", "Miercoles", "Jueves", "Viernes", "Sabado", "Domingo"]

In [73]:
serie = pd.Series(indices, index = [valores])
serie

9         Lunes
19       Martes
11    Miercoles
5        Jueves
18      Viernes
13       Sabado
6       Domingo
dtype: object

Crea una Serie con el diccionario creado en el punto anterior.

¿Qué forma tiene esta última Serie?

¿Qué tipo de datos tiene?

¿Qué tamaño tiene?

¿Cuáles son los índices de la Serie?

¿Y los values?

Extrae el valor para el índice "lunes"

Extrae el valor para el índice "lunes", "martes" y "miércoles".

Extrae el valor para el índice "lunes" y "domingo".

In [ ]:
dicc = serie.to_dict()
dicc

{(9,): 'Lunes',
 (19,): 'Martes',
 (11,): 'Miercoles',
 (5,): 'Jueves',
 (18,): 'Viernes',
 (13,): 'Sabado',
 (6,): 'Domingo'}